cracking-windows-7.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-11-23 Sat 00:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cracking a Windows 7 Password</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Cracking a Windows 7 Password</h1>
<p>
Windows 7 stores passwords using NTLM, an unsalted hash vulnerable to
rainbow table attacks in addition to brute-force/dictionary attacks.
</p>

<div id="outline-container-orgb5c6da1" class="outline-2">
<h2 id="orgb5c6da1">Dumping the hash</h2>
<div class="outline-text-2" id="text-orgb5c6da1">
<p>
Boot into another drive with access to the target drive. Everything
needed to dump the target drive resides in \Windows\System32\config,
so copy this directory and move to a machine of your choice. 
</p>

<p>
Dumping a Windows 7 hash is more involved than on El Capitan<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>, but
ophcrack automates it:
</p>

<div class="org-src-container">
<pre class="src src-bash">$ sudo apt-get install ophcrack
$ ophcrack
</pre>
</div>

<p>
You can provide ophcrack the config directory from the target
machine and it will dump each user's password hash in plaintext (I
have not found a way to dump the hash from the ophcrack command-line
interface). With the hash in cleartext, we can now use the attack of
our choice.
</p>
</div>
</div>

<div id="outline-container-orgd64fc07" class="outline-2">
<h2 id="orgd64fc07">Rainbow Table Attack</h2>
<div class="outline-text-2" id="text-orgd64fc07">
<p>
Because the NTLM hash is unsalted, it is vulnerable to rainbow table
attacks. The authors of ophcrack have made publicly available
multiple terabytes of rainbow tables for use with various editions of
Windows. These rainbow tables can be downloaded from their
webpage<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>, extracted, and used:
</p>

<div class="org-src-container">
<pre class="src src-bash">$ mkdir tables
$ unzip tables_vista_free.zip -d tables/vista_free
$ ophcrack -g -d ./tables -t vista_free -f hash.txt
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc933c76" class="outline-2">
<h2 id="orgc933c76">Dictionary Attack</h2>
<div class="outline-text-2" id="text-orgc933c76">
<p>
The hash can also be attacked with a dictionary of possible passwords
(or by brute-force) using password recovery tools such as John the
Ripper or Hashcat<sup><a id="fnr.1.100" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="hacking-my-laptop.html">hacking-my-laptop.html</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://ophcrack.sourceforge.io/tables.php">https://ophcrack.sourceforge.io/tables.php</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p>hi</p>
</div>
</body>
</html>
